app/views/sentiment/select_collection.html.erb


                                                    <% @label_sets = LabelSet.where(collection_id: c.id) %>
---
SELECT "label_sets".* FROM "label_sets" WHERE "label_sets"."collection_id" = ?  [["collection_id", 1]]