app/views/shared/_nav.html.erb

SELECT "notifications".* FROM "notifications"
SELECT COUNT(*) FROM "notifications"
---

                                    <span class="notification"><%= notes.size %></span>