app/views/data/view_data.html.erb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."job_id" = ?  [["job_id", 1]]
---
                                <div class="card-body table-responsive">
                                    <%= line_chart Tweet.where(job_id: params[:coll_id]).group_by_minute_of_hour(:tweet_time).count %>