app/controllers/centrality_controller.rb

SELECT "collections".* FROM "collections"
---
	def select_collection
		@collections = Collection.all

SELECT "tweets".* FROM "tweets" WHERE "tweets"."job_id" = ?  [["job_id", 1]]
---
	def calculate_centrality
		@tweets = Tweet.where(job_id: params[:collection_id])