app/controllers/data_controller.rb

	def browse
		@collections = Collection.all
---
SELECT "collections".* FROM "collections"

	def view_data
		@tweets = Tweet.where(job_id: params[:coll_id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."job_id" = ?  [["job_id", 1]]

	def collections
		@collections = Collection.all
---
SELECT "collections".* FROM "collections"

	def process_upload
		puts params
		@collection = Collection.new

		@collection.collection_name = params[:collection_name]

		@collection.save

		uploaded_io = params[:tweet_file]

		f = true

  		CSV.foreach(uploaded_io.path) do |r|
			if f then
				f = false
			else
				@tweet = Tweet.new
				@tweet.tweet_text = r[1]
				@tweet.tweet_lat = r[2]
				@tweet.tweet_lon = r[3]
				@tweet.tweet_user = r[4]
				@tweet.tweet_time = r[5]
				@tweet.job_id = @collection.id

				@tweet.save
---
INSERT INTO "collections" ("collection_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["collection_name", "2000 Location"], ["created_at", "2018-11-23 02:24:16.047141"], ["updated_at", "2018-11-23 02:24:16.047141"]]
INSERT INTO "tweets" ("tweet_text", "tweet_lat", "tweet_lon", "tweet_user", "tweet_time", "job_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)