app/controllers/geo_controller.rb

	def select_data
		@tweets = Tweet.where(job_id: 21).where("tweet_lat IS NOT NULL")#.limit(1000)
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."job_id" = ? LIMIT ?  [["job_id", 5], ["LIMIT", 1000]]