app/controllers/sentiment_controller.rb

	def select_collection
		@collections = Collection.all
---
SELECT "collections".* FROM "collections"

	def process_upload
		@collection = Collection.new

		@collection.collection_name = params[:collection_name]
		@collection.save

		@label_set = LabelSet.new
		@label_set.label_set_name = params[:label_set_name]
		@label_set.collection_id = @collection.id
		@label_set.save
---
INSERT INTO "collections" ("collection_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["collection_name", "2000 Location"], ["created_at", "2018-11-23 02:22:15.579686"], ["updated_at", "2018-11-23 02:22:15.579686"]]
INSERT INTO "label_sets" ("collection_id", "created_at", "updated_at", "label_set_name") VALUES (?, ?, ?, ?)  [["collection_id", 1], ["created_at", "2018-11-23 02:22:15.761320"], ["updated_at", "2018-11-23 02:22:15.761320"], ["label_set_name", "2000 Location"]]

				@attach_label.tweet_id = @tweet.id
				@attach_label.label_set_id = @label_set.id

				@tweet.save
---
INSERT INTO "tweets" ("tweet_text", "tweet_user", "tweet_time", "job_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)