app/controllers/summary_controller.rb

	def select_collection
		@collections = Collection.all
---
SELECT "collections".* FROM "collections"

	def view_result_sets
		@results = SummarizationResult.where(collection_id: params[:cid]).order(created_at: :desc)
		@collection = Collection.find(params[:cid])
---
SELECT "summarization_results".* FROM "summarization_results" WHERE "summarization_results"."collection_id" = ? ORDER BY "summarization_results"."created_at" DESC  [["collection_id", "1"]]
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]