app/controllers/topic_controller.rb

SELECT "topic_analysis_results".* FROM "topic_analysis_results" WHERE "topic_analysis_results"."collection_id" = ? ORDER BY "topic_analysis_results"."created_at" DESC  [["collection_id", 1]]
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def view_result_sets
		@results = TopicAnalysisResult.where(collection_id: params[:cid]).order(created_at: :desc)
		@collection = Collection.find(params[:cid])

SELECT "topics".* FROM "topics" WHERE "topics"."topic_result_id" = ? ORDER BY "topics"."topic_number" ASC  [["topic_result_id", 1]]
---
	def view_results
		@topics = Topic.where(topic_result_id: params[:cid]).order(:topic_number)

SELECT "collections".* FROM "collections"
---
	def select_collection
		@collections = Collection.all

SELECT  "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def run_lda
		nwords = params[:nwords].to_i
		ntopics = params[:ntopics].to_i
		desc = params[:desc]
		@collection = Collection.find(params[:collection_id])