app/views/topic/view_results.erb

                                                <tr>
                                                <% @words = TopicWord.where(topic_id: top.id).order(:order_number) %>
---
SELECT "topic_words".* FROM "topic_words" WHERE "topic_words"."topic_id" = ? ORDER BY "topic_words"."order_number" ASC  [["topic_id", 1]]